---
kind: type
id: T:Autodesk.Revit.DB.Visual.HardwoodTintEnabledType
source: html/eea7a17a-2dc7-0f80-956e-d5f54be26058.htm
---
# Autodesk.Revit.DB.Visual.HardwoodTintEnabledType

The enumerated type representing the permitted values for the asset property "HardwoodTintEnabled" from the "Hardwood" schema.

## Syntax (C#)
```csharp
public enum HardwoodTintEnabledType
```